I don't know why the downloaded log has all of those strange characters, but this is what the apply log loogs like. And I have configured in the plan log that the .sg_a and .sg_b values expand to what I expect. Is this helpful? I couldn't figure out how to get debug logs. 


`
Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_eks_cluster.eks_cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_cluster" "eks_cluster" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mcertificate_authority[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mcreated_at[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mendpoint[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0midentity[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                  = "terraformEKS_cl"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mrole_arn[0m[0m              = "arn:aws-us-gov:iam::<ID>:role/eksClusterRole"
      [32m+[0m [0m[1m[0mstatus[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)

      [32m+[0m [0mkubernetes_network_config {
          [32m+[0m [0m[1m[0mip_family[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mservice_ipv4_cidr[0m[0m = (known after apply)
        }

      [32m+[0m [0mvpc_config {
          [32m+[0m [0m[1m[0mcluster_security_group_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mendpoint_private_access[0m[0m   = true
          [32m+[0m [0m[1m[0mendpoint_public_access[0m[0m    = false
          [32m+[0m [0m[1m[0mpublic_access_cidrs[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0msecurity_group_ids[0m[0m        = [
              [32m+[0m [0m"sg-0707edb3d7c47b687",
              [32m+[0m [0m"sg-0db4845394a371218",
            ]
          [32m+[0m [0m[1m[0msubnet_ids[0m[0m                = [
              [32m+[0m [0m"subnet-015b8e44e0fabd60e",
              [32m+[0m [0m"subnet-0b5f50664c97619b8",
              [32m+[0m [0m"subnet-0e6c8dd6171b0d4a1",
            ]
          [32m+[0m [0m[1m[0mvpc_id[0m[0m                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.eks_nodegroup[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_eks_node_group" "eks_nodegroup" {
      [32m+[0m [0m[1m[0mami_type[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mcapacity_type[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mcluster_name[0m[0m           = "terraformEKS_cl"
      [32m+[0m [0m[1m[0mdisk_size[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0minstance_types[0m[0m         = [
          [32m+[0m [0m"t3.small",
        ]
      [32m+[0m [0m[1m[0mnode_group_name[0m[0m        = "nodegroup_cl"
      [32m+[0m [0m[1m[0mnode_group_name_prefix[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mnode_role_arn[0m[0m          = "arn:aws-us-gov:iam::921714618144:role/AmazonEKSNodeRole"
      [32m+[0m [0m[1m[0mrelease_version[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mresources[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mstatus[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msubnet_ids[0m[0m             = [
          [32m+[0m [0m"subnet-015b8e44e0fabd60e",
          [32m+[0m [0m"subnet-0b5f50664c97619b8",
          [32m+[0m [0m"subnet-0e6c8dd6171b0d4a1",
        ]
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mversion[0m[0m                = (known after apply)

      [32m+[0m [0mremote_access {
          [32m+[0m [0m[1m[0mec2_ssh_key[0m[0m               = "EKS_Cluster_Key_Pair"
          [32m+[0m [0m[1m[0msource_security_group_ids[0m[0m = [
              [32m+[0m [0m"<sg_a>",
              [32m+[0m [0m"<sg_b>",
            ]
        }

      [32m+[0m [0mscaling_config {
          [32m+[0m [0m[1m[0mdesired_size[0m[0m = 1
          [32m+[0m [0m[1m[0mmax_size[0m[0m     = 1
          [32m+[0m [0m[1m[0mmin_size[0m[0m     = 1
        }

      [32m+[0m [0mupdate_config {
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mmax_unavailable_percentage[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m
`